JosaPcc(
  (first_layer): Linear(in_features=8, out_features=8, bias=True)
  (hidden_layer): ModuleList(
    (0): Linear(in_features=8, out_features=8, bias=True)
    (1): Linear(in_features=8, out_features=8, bias=True)
    (2): Linear(in_features=8, out_features=8, bias=True)
    (3): Linear(in_features=8, out_features=8, bias=True)
    (4): Linear(in_features=8, out_features=8, bias=True)
  )
  (last_layer): Linear(in_features=8, out_features=2, bias=True)
)
{'lr': 0.001, 'batch_size': 1, 'fold_num': 1, 'data_name': 'CC2018', 'time_file': '15-21-56', 'seed': '666'}